{
  "nodes": [
    {
      "op": "null", 
      "name": "data/0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t0_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[5, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation2", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation1", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul0", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation0", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation3", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[11, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul1", 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[15, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation4", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul2", 
      "inputs": [[12, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attr": {"p": "0.2"}, 
      "inputs": [[21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l1_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[25, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "l1_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul3", 
      "inputs": [[33, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation8", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[31, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul4", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[35, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation9", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul5", 
      "inputs": [[32, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout1", 
      "attr": {"p": "0.2"}, 
      "inputs": [[41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l2_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[45, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[50, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation12", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation11", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "l2_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul6", 
      "inputs": [[53, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation10", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation13", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[51, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul7", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[55, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation14", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul8", 
      "inputs": [[52, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout2", 
      "attr": {"p": "0.2"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "cls_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "cls_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected0", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/0", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t0_sm", 
      "inputs": [[65, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/1", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t1_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[68, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[69, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[21, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation17", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation16", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul9", 
      "inputs": [[75, 0, 0], [19, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation15", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[73, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[76, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation19", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[80, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul11", 
      "inputs": [[74, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout3", 
      "attr": {"p": "0.2"}, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[83, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[41, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[86, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation22", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation21", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul12", 
      "inputs": [[89, 0, 0], [39, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation20", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation23", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[87, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul13", 
      "inputs": [[91, 0, 0], [92, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[90, 0, 0], [93, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation24", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul14", 
      "inputs": [[88, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout4", 
      "attr": {"p": "0.2"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[97, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[61, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus10", 
      "inputs": [[98, 0, 0], [99, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[100, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation27", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation26", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul15", 
      "inputs": [[103, 0, 0], [59, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation25", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation28", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[101, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul16", 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus11", 
      "inputs": [[104, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation29", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul17", 
      "inputs": [[102, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout5", 
      "attr": {"p": "0.2"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected1", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[111, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/1", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t1_sm", 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/2", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t2_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[115, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[116, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[82, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus12", 
      "inputs": [[117, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation32", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation31", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul18", 
      "inputs": [[122, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation30", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation33", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[120, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul19", 
      "inputs": [[124, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus13", 
      "inputs": [[123, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation34", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul20", 
      "inputs": [[121, 0, 0], [128, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout6", 
      "attr": {"p": "0.2"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[130, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[96, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus14", 
      "inputs": [[131, 0, 0], [132, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation37", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation36", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul21", 
      "inputs": [[136, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation35", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation38", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[134, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul22", 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus15", 
      "inputs": [[137, 0, 0], [140, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation39", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul23", 
      "inputs": [[135, 0, 0], [142, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout7", 
      "attr": {"p": "0.2"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[144, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[110, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus16", 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation42", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation41", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul24", 
      "inputs": [[150, 0, 0], [108, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation40", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation43", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[148, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul25", 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus17", 
      "inputs": [[151, 0, 0], [154, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation44", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul26", 
      "inputs": [[149, 0, 0], [156, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout8", 
      "attr": {"p": "0.2"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected2", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[158, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/2", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t2_sm", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/3", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t3_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[162, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[163, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[129, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus18", 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation47", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation46", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul27", 
      "inputs": [[169, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation45", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation48", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[167, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul28", 
      "inputs": [[171, 0, 0], [172, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus19", 
      "inputs": [[170, 0, 0], [173, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation49", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul29", 
      "inputs": [[168, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout9", 
      "attr": {"p": "0.2"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[177, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[143, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus20", 
      "inputs": [[178, 0, 0], [179, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation52", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation51", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul30", 
      "inputs": [[183, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation50", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[181, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation53", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[181, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul31", 
      "inputs": [[185, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus21", 
      "inputs": [[184, 0, 0], [187, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation54", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[188, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul32", 
      "inputs": [[182, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout10", 
      "attr": {"p": "0.2"}, 
      "inputs": [[190, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[191, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[157, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus22", 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation57", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation56", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul33", 
      "inputs": [[197, 0, 0], [155, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation55", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation58", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[195, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul34", 
      "inputs": [[199, 0, 0], [200, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus23", 
      "inputs": [[198, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation59", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[202, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul35", 
      "inputs": [[196, 0, 0], [203, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout11", 
      "attr": {"p": "0.2"}, 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected3", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[205, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/3", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t3_sm", 
      "inputs": [[206, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/4", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t4_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[209, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[210, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[176, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus24", 
      "inputs": [[211, 0, 0], [212, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[213, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation62", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation61", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul36", 
      "inputs": [[216, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation60", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation63", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[214, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul37", 
      "inputs": [[218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus25", 
      "inputs": [[217, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation64", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[221, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul38", 
      "inputs": [[215, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout12", 
      "attr": {"p": "0.2"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[224, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[190, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus26", 
      "inputs": [[225, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[227, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation67", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation66", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul39", 
      "inputs": [[230, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation65", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[228, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation68", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[228, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul40", 
      "inputs": [[232, 0, 0], [233, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus27", 
      "inputs": [[231, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation69", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul41", 
      "inputs": [[229, 0, 0], [236, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout13", 
      "attr": {"p": "0.2"}, 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[238, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[204, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus28", 
      "inputs": [[239, 0, 0], [240, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation72", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation71", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul42", 
      "inputs": [[244, 0, 0], [202, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation70", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation73", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[242, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul43", 
      "inputs": [[246, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus29", 
      "inputs": [[245, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation74", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[249, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul44", 
      "inputs": [[243, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout14", 
      "attr": {"p": "0.2"}, 
      "inputs": [[251, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected4", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[252, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/4", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t4_sm", 
      "inputs": [[253, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/5", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t5_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[256, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[257, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[223, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus30", 
      "inputs": [[258, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation77", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation76", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul45", 
      "inputs": [[263, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation75", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation78", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[261, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul46", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus31", 
      "inputs": [[264, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation79", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[268, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul47", 
      "inputs": [[262, 0, 0], [269, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout15", 
      "attr": {"p": "0.2"}, 
      "inputs": [[270, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[271, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[237, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus32", 
      "inputs": [[272, 0, 0], [273, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[274, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation82", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation81", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul48", 
      "inputs": [[277, 0, 0], [235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation80", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[275, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation83", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[275, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul49", 
      "inputs": [[279, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus33", 
      "inputs": [[278, 0, 0], [281, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation84", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul50", 
      "inputs": [[276, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout16", 
      "attr": {"p": "0.2"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[285, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[251, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus34", 
      "inputs": [[286, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[288, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation87", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation86", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul51", 
      "inputs": [[291, 0, 0], [249, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation85", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[289, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation88", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[289, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul52", 
      "inputs": [[293, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus35", 
      "inputs": [[292, 0, 0], [295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation89", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul53", 
      "inputs": [[290, 0, 0], [297, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout17", 
      "attr": {"p": "0.2"}, 
      "inputs": [[298, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[299, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/5", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t5_sm", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/6", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t6_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[303, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[304, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[270, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus36", 
      "inputs": [[305, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation92", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation91", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul54", 
      "inputs": [[310, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation90", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation93", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[308, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul55", 
      "inputs": [[312, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus37", 
      "inputs": [[311, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation94", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul56", 
      "inputs": [[309, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout18", 
      "attr": {"p": "0.2"}, 
      "inputs": [[317, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[318, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[284, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus38", 
      "inputs": [[319, 0, 0], [320, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[321, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation97", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation96", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul57", 
      "inputs": [[324, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation95", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[322, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation98", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[322, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul58", 
      "inputs": [[326, 0, 0], [327, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus39", 
      "inputs": [[325, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation99", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[329, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul59", 
      "inputs": [[323, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout19", 
      "attr": {"p": "0.2"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[332, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[298, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus40", 
      "inputs": [[333, 0, 0], [334, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[335, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation102", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation101", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul60", 
      "inputs": [[338, 0, 0], [296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation100", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[336, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation103", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[336, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul61", 
      "inputs": [[340, 0, 0], [341, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus41", 
      "inputs": [[339, 0, 0], [342, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation104", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[343, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul62", 
      "inputs": [[337, 0, 0], [344, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout20", 
      "attr": {"p": "0.2"}, 
      "inputs": [[345, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attr": {"num_hidden": "84"}, 
      "inputs": [[346, 0, 0], [63, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label/6", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "t6_sm", 
      "inputs": [[347, 0, 0], [348, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data/7", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "t7_embed", 
      "attr": {
        "input_dim": "84", 
        "output_dim": "256"
      }, 
      "inputs": [[350, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[351, 0, 0], [3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[317, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus42", 
      "inputs": [[352, 0, 0], [353, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[354, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation107", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation106", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul63", 
      "inputs": [[357, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation105", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[355, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation108", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[355, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul64", 
      "inputs": [[359, 0, 0], [360, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus43", 
      "inputs": [[358, 0, 0], [361, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation109", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[362, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul65", 
      "inputs": [[356, 0, 0], [363, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout21", 
      "attr": {"p": "0.2"}, 
      "inputs": [[364, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[365, 0, 0], [23, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l1_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[331, 0, 0], [27, 0, 0], [28, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus44", 
      "inputs": [[366, 0, 0], [367, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l1_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[368, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation112", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation111", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul66", 
      "inputs": [[371, 0, 0], [329, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation110", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[369, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation113", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[369, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul67", 
      "inputs": [[373, 0, 0], [374, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus45", 
      "inputs": [[372, 0, 0], [375, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation114", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[376, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul68", 
      "inputs": [[370, 0, 0], [377, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout22", 
      "attr": {"p": "0.2"}, 
      "inputs": [[378, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l2_i2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[379, 0, 0], [43, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l2_h2h", 
      "attr": {"num_hidden": "2048"}, 
      "inputs": [[345, 0, 0], [47, 0, 0], [48, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus46", 
      "inputs": [[380, 0, 0], [381, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l2_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[382, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation117", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[383, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation116", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[383, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul69", 
      "inputs": [[385, 0, 0], [343, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation115", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[383, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation118", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[383, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul70", 
      "inputs": [[387, 0, 0], [388, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus47", 
      "inputs": [[386, 0, 0], [389, 0, 0]]
    }, 
    {
      "op": "Activation", 
