{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "embed_weight", 
      "inputs": []
    }, 
    {
      "op": "Embedding", 
      "name": "embedding3", 
      "attr": {
        "input_dim": "80963", 
        "output_dim": "100"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "slicechannel3", 
      "attr": {
        "num_outputs": "200", 
        "squeeze_axis": "1"
      }, 
      "inputs": [[2, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_i2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t199_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 199, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t198_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 198, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t197_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 197, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t196_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 196, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t195_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 195, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t194_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 194, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t193_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 193, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t192_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 192, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t191_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 191, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t190_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 190, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t189_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 189, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t188_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 188, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t187_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 187, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t186_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 186, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t185_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 185, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t184_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 184, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t183_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 183, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t182_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 182, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t181_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 181, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t180_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 180, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t179_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 179, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t178_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 178, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t177_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 177, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t176_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 176, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t175_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 175, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t174_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 174, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t173_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 173, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t172_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 172, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t171_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 171, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t170_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 170, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t169_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 169, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t168_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 168, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t167_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 167, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t166_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 166, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t165_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 165, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t164_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 164, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t163_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 163, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t162_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 162, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t161_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 161, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t160_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 160, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t159_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 159, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t158_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 158, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t157_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 157, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t156_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 156, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t155_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 155, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t154_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 154, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t153_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 153, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t152_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 152, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t151_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 151, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t150_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 150, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t149_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 149, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t148_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 148, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t147_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 147, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t146_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 146, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t145_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 145, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t144_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 144, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t143_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 143, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t142_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 142, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t141_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 141, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t140_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 140, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t139_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 139, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t138_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 138, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t137_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 137, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t136_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 136, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t135_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 135, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t134_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 134, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t133_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 133, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t132_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 132, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t131_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 131, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t130_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 130, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t129_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 129, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t128_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 128, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t127_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 127, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t126_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 126, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t125_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 125, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t124_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 124, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t123_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 123, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t122_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 122, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t121_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 121, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t120_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 120, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t119_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 119, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t118_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 118, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t117_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 117, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t116_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 116, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t115_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 115, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t114_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 114, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t113_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 113, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t112_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 112, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t111_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 111, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t110_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 110, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t109_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 109, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t108_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 108, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t107_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 107, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t106_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 106, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t105_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 105, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t104_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 104, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t103_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 103, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t102_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 102, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t101_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 101, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t100_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 100, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t99_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 99, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t98_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 98, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t97_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 97, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t96_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 96, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t95_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 95, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t94_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 94, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t93_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 93, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t92_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 92, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t91_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 91, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t90_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 90, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t89_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 89, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t88_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 88, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t87_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 87, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t86_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 86, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t85_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 85, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t84_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 84, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t83_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 83, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t82_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 82, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t81_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 81, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t80_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 80, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t79_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 79, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t78_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 78, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t77_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 77, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t76_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 76, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t75_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 75, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t74_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 74, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t73_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 73, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t72_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 72, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t71_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 71, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t70_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 70, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t69_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 69, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t68_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 68, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t67_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 67, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t66_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 66, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t65_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 65, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t64_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 64, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t63_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 63, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t62_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 62, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t61_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 61, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t60_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 60, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t59_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 59, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t58_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 58, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t57_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 57, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t56_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 56, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t55_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 55, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t54_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 54, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t53_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 53, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t52_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 52, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t51_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 51, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t50_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 50, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t49_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 49, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t48_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 48, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t47_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 47, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t46_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 46, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t45_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 45, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t44_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 44, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t43_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 43, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t42_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 42, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t41_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 41, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t40_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 40, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t39_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 39, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t38_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 38, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t37_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 37, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t36_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 36, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t35_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 35, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t34_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 34, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t33_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 33, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t32_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 32, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t31_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 31, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t30_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 30, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t29_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 29, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t28_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 28, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t27_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 27, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t26_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 26, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t25_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 25, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t24_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 24, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t23_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 23, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t22_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 22, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t21_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 21, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t20_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 20, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t19_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 19, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t18_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 18, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t17_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 17, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t16_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 16, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t15_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 15, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t14_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 14, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t13_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 13, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t12_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 12, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t11_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 11, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 10, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 9, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 8, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 7, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 6, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 5, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 4, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 3, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 2, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 1, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_i2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[3, 0, 0], [4, 0, 0], [5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_h", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "l0_h2h_bias", 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "t0_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[206, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7200", 
      "inputs": [[205, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t0_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18002", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18001", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 1, 0]]
    }, 
    {
      "op": "null", 
      "name": "l0_init_c", 
      "inputs": []
    }, 
    {
      "op": "_mul", 
      "name": "_mul10800", 
      "inputs": [[213, 0, 0], [214, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18000", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[211, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18003", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[211, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10801", 
      "inputs": [[216, 0, 0], [217, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7201", 
      "inputs": [[215, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18004", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[219, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10802", 
      "inputs": [[212, 0, 0], [220, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t1_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[221, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7204", 
      "inputs": [[204, 0, 0], [222, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t1_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[223, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18012", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18011", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10806", 
      "inputs": [[226, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18010", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18013", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[224, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10807", 
      "inputs": [[228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7205", 
      "inputs": [[227, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18014", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[231, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10808", 
      "inputs": [[225, 0, 0], [232, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t2_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[233, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7208", 
      "inputs": [[203, 0, 0], [234, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t2_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[235, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18022", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[236, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18021", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[236, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10812", 
      "inputs": [[238, 0, 0], [231, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18020", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18023", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[236, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10813", 
      "inputs": [[240, 0, 0], [241, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7209", 
      "inputs": [[239, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18024", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[243, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10814", 
      "inputs": [[237, 0, 0], [244, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t3_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[245, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7212", 
      "inputs": [[202, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t3_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[247, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18032", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[248, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18031", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[248, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10818", 
      "inputs": [[250, 0, 0], [243, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18030", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[248, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18033", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[248, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10819", 
      "inputs": [[252, 0, 0], [253, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7213", 
      "inputs": [[251, 0, 0], [254, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18034", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[255, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10820", 
      "inputs": [[249, 0, 0], [256, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t4_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[257, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7216", 
      "inputs": [[201, 0, 0], [258, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t4_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18042", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[260, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18041", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[260, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10824", 
      "inputs": [[262, 0, 0], [255, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18040", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[260, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18043", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[260, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10825", 
      "inputs": [[264, 0, 0], [265, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7217", 
      "inputs": [[263, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18044", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[267, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10826", 
      "inputs": [[261, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t5_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[269, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7220", 
      "inputs": [[200, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t5_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[271, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18052", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[272, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18051", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[272, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10830", 
      "inputs": [[274, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18050", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[272, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18053", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[272, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10831", 
      "inputs": [[276, 0, 0], [277, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7221", 
      "inputs": [[275, 0, 0], [278, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18054", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10832", 
      "inputs": [[273, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t6_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[281, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7224", 
      "inputs": [[199, 0, 0], [282, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t6_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[283, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18062", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18061", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10836", 
      "inputs": [[286, 0, 0], [279, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18060", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[284, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18063", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[284, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10837", 
      "inputs": [[288, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7225", 
      "inputs": [[287, 0, 0], [290, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18064", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[291, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10838", 
      "inputs": [[285, 0, 0], [292, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t7_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[293, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7228", 
      "inputs": [[198, 0, 0], [294, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t7_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[295, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18072", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[296, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18071", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[296, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10842", 
      "inputs": [[298, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18070", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[296, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18073", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[296, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10843", 
      "inputs": [[300, 0, 0], [301, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7229", 
      "inputs": [[299, 0, 0], [302, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18074", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[303, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10844", 
      "inputs": [[297, 0, 0], [304, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t8_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[305, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7232", 
      "inputs": [[197, 0, 0], [306, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t8_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[307, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18082", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18081", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10848", 
      "inputs": [[310, 0, 0], [303, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18080", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[308, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18083", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[308, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10849", 
      "inputs": [[312, 0, 0], [313, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7233", 
      "inputs": [[311, 0, 0], [314, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18084", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[315, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10850", 
      "inputs": [[309, 0, 0], [316, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t9_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[317, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7236", 
      "inputs": [[196, 0, 0], [318, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t9_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[319, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18092", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[320, 2, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18091", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[320, 1, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10854", 
      "inputs": [[322, 0, 0], [315, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18090", 
      "attr": {"act_type": "sigmoid"}, 
      "inputs": [[320, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18093", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[320, 3, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10855", 
      "inputs": [[324, 0, 0], [325, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7237", 
      "inputs": [[323, 0, 0], [326, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation18094", 
      "attr": {"act_type": "tanh"}, 
      "inputs": [[327, 0, 0]]
    }, 
    {
      "op": "_mul", 
      "name": "_mul10856", 
      "inputs": [[321, 0, 0], [328, 0, 0]]
    }, 
    {
      "op": "FullyConnected", 
      "name": "t10_l0_h2h", 
      "attr": {"num_hidden": "200"}, 
      "inputs": [[329, 0, 0], [207, 0, 0], [208, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7240", 
      "inputs": [[195, 0, 0], [330, 0, 0]]
    }, 
    {
      "op": "SliceChannel", 
      "name": "t10_l0_slice", 
      "attr": {"num_outputs": "4"}, 
      "inputs": [[331, 0, 0]]
    }, 
    {
